CSI API ETABS v1
cPropMaterial.SetSSCurve Method
 Sets the material stress-strain curve for materials that are specified to have user-defined stress-strain curves.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSSCurve(
	string Name,
	int NumberPoints,
	ref int[] PointID,
	ref double[] Strain,
	ref double[] Stress,
	double Temp = 0
)
Function SetSSCurve (
	Name As String,
	NumberPoints As Integer,
	ByRef PointID As Integer(),
	ByRef Strain As Double(),
	ByRef Stress As Double(),
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim NumberPoints As Integer
Dim PointID As Integer()
Dim Strain As Double()
Dim Stress As Double()
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetSSCurve(Name,
	NumberPoints, PointID, Strain, Stress,
	Temp)
int SetSSCurve(
	String^ Name,
	int NumberPoints,
	array<int>^% PointID,
	array<double>^% Strain,
	array<double>^% Stress,
	double Temp = 0
)
abstract SetSSCurve :
        Name : string *
        NumberPoints : int *
        PointID : int[] byref *
        Strain : float[] byref *
        Stress : float[] byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
NumberPoints
Type: System.Int32
The number of points in the stress-strain curve. This item must be at least 3.
PointID
Type: System.Int32[]
This is one of the following integers which sets the point ID. The point ID controls the color that will be displayed for hinges in a deformed shape plot.
Value | Point ID
-5 | -E
-4 | -D
-3 | -C
-2 | -B
-1 | -A
0 | None
1 | A
2 | B
3 | C
4 | D
5 | E
The point IDs must be input in numerically increasing order, except that 0 (None) values are allowed anywhere. No duplicate values are allowed excepth for 0 (None).
Strain
Type: System.Double[]
This is an array that includes the strain at each point on the stress strain curve. The strains must increase monotonically.
Stress
Type: System.Double[]
This is an array that includes the stress at each point on the stress strain curve. [F/L2]
Points that have a negative strain must have a zero or negative stress. Similarly, points that have a positive strain must have a zero or positive stress.
There must be one point defined that has zero strain and zero stress.
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim PointID() As Integer
       Dim Strain() As Double
       Dim Stress() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign other properties
       ret = SapModel.PropMaterial.SetOSteel("Steel", 55, 68, 60, 70, 0, 1, 0, 0, 0)
   'assign user SS curve
       ReDim PointID(4)
       ReDim Strain(4)
       ReDim Stress(4)
       Strain(0) = -0.003:  Stress(0) = -50:  PointID(0) = -3
       Strain(1) = -0.001:  Stress(1) = -25:  PointID(1) = 0
       Strain(2) = 0:       Stress(2) = -0:   PointID(2) = 1
       Strain(3) = 0.003:   Stress(3) = 40:   PointID(3) = 0
       Strain(4) = 0.008:   Stress(4) = 80:   PointID(4) = 5
       ret = SapModel.PropMaterial.SetSSCurve("Steel", 5, PointID, Strain, Stress)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace